#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеДоступностьюПолей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	УправлениеДоступностьюПолей();
КонецПроцедуры

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	УправлениеДоступностьюПолей();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеДоступностьюПолей()
	
	Если Запись.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорииСотрудников.АдминистративныйПерсонал") Тогда
		
		Если Запись.ПроцентОтРабот > 0 Тогда
			
			ТекстСообщения = "Для Административного персонала процент премии не указывается!";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Запись.ПроцентОтРабот");
			Запись.ПроцентОтРабот = 0; 
		КонецЕсли;

		Элементы.ПроцентОтРабот.Доступность = Ложь;
		
	Иначе

		Элементы.ПроцентОтРабот.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
