#Область СлужебныеПроцедурыИФункции

// Возвращает строку представления категории сотрудника для добавления в ФИО.
//
// Параметры:
//  СсылкаСотрудника - СправочникСсылка.Пользователи - Ссылка на проверяемого сотрудника.
//
// Возвращаемое значение:
//  Строка - Текст категории в скобках или пустая строка.

Функция ПолучитьТекстКатегорииСотрудника(СсылкаСотрудника) Экспорт
	
	ПараметрыОтбора = Новый Структура("Сотрудник", СсылкаСотрудника);
	
	ТаблицаКатегорий = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(ТекущаяДатаСеанса(), ПараметрыОтбора); 
	
	Если ТаблицаКатегорий.Количество() > 0 Тогда
		Возврат " (" + Строка(ТаблицаКатегорий[0].Категория) + ")";		// СрезПоследних вернул Таблицу Значений, а не массив
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти