#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда  
        Возврат;  
	КонецЕсли; 

	КрасиваяДата = Формат(Дата, "ДФ='dd.MM.yyyy ""г.""'");

	Если ЭтоНовый() Тогда 
		
		Фамилия = ПолучитьФамилиюСпециалиста(Специалист);
		ПредставлениеДокумента = СтрШаблон("документ от %1", КрасиваяДата);
		
		ТекстСообщения = СтрШаблон("Специалист %1, вам новая заявка — %2!", Фамилия, ПредставлениеДокумента);
		СоздатьСообщениеБоту(ТекстСообщения);
		
	Иначе
		СтарыеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, 
			"ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист, Номер, Дата");
		
		ЧистыйНомерВСообщение = СтрЗаменить(Формат(Число(СтарыеЗначения.Номер), "ЧГ=0"), Символы.НПП, "");
		ДатаВСоощение = Формат(СтарыеЗначения.Дата, "ДФ='dd.MM.yyyy ""г.""'");
		ПредставлениеДокумента = СтрШаблон("№ %1 от %2", ЧистыйНомерВСообщение, ДатаВСоощение);
		
		Если СтарыеЗначения.Специалист <> Специалист Тогда
			
			ФамилияВСообщение = ПолучитьФамилиюСпециалиста(Специалист);
			ТекстСообщения = СтрШаблон("Специалист %1, по заявке %2 — вы назначены исполнителем!", ФамилияВСообщение, ПредставлениеДокумента);
			СоздатьСообщениеБоту(ТекстСообщения);
			
		Иначе
			ТекстИзменений = "";
			
			Если СтарыеЗначения.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда 
				ТекстИзменений = ТекстИзменений + "дата, ";
			КонецЕсли;
			
			Если СтарыеЗначения.ВремяНачалаРабот <> ВремяНачалаРабот Тогда
				ТекстИзменений = ТекстИзменений + "время начала, ";
			КонецЕсли;
			
			Если СтарыеЗначения.ВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
				ТекстИзменений = ТекстИзменений + "время окончания, ";
			КонецЕсли;

			Если ЗначениеЗаполнено(ТекстИзменений) Тогда
				
				ТекстИзменений = Лев(СокрЛП(ТекстИзменений), СтрДлина(СокрЛП(ТекстИзменений)) - 1); // Убираю запятую в конце
				
				Фамилия = ПолучитьФамилиюСпециалиста(Специалист);
				ТекстСообщения = СтрШаблон("Специалист %1, обратите внимание — в вашей заявке %2 сменилось %3!", 
					Фамилия, ПредставлениеДокумента, ТекстИзменений);
					
				СоздатьСообщениеБоту(ТекстСообщения);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
	    ОбщегоНазначения.СообщитьПользователю("Не выбран договор!", , , , Отказ);
	    Возврат;
	КонецЕсли;
	 
	СписокРеквизитов = "ВидДоговора, ВКМ_НачалоДействияДоговора, ВКМ_ОкончаниеДействияДоговора, ВКМ_СтоимостьЧасаРаботы";
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, СписокРеквизитов);
	
	Если СтруктураРеквизитов.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	    ОбщегоНазначения.СообщитьПользователю("Договор должен иметь вид ""Абонентское обслуживание""!", , , , Отказ);
	    Возврат;
	КонецЕсли;
	
	НачалоДняДокумента = НачалоДня(Дата);
	
	Если НачалоДняДокумента < СтруктураРеквизитов.ВКМ_НачалоДействияДоговора
	    Или (ЗначениеЗаполнено(СтруктураРеквизитов.ВКМ_ОкончаниеДействияДоговора) 
	        И НачалоДняДокумента > СтруктураРеквизитов.ВКМ_ОкончаниеДействияДоговора) Тогда
	    
	    ОбщегоНазначения.СообщитьПользователю("Дата документа выходит за рамки действия договора!", , , , Отказ);
	    Возврат;
	КонецЕсли;
    
	Если СтруктураРеквизитов.ВКМ_СтоимостьЧасаРаботы = 0 Тогда
	    ОбщегоНазначения.СообщитьПользователю("В выбранном договоре установлена нулевая стоимость часа работы!", , "Договор");
	КонецЕсли;
    
	СтоимостьЧасаКлиента = СтруктураРеквизитов.ВКМ_СтоимостьЧасаРаботы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
			|ВЫБРАТЬ
			|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
			|ИЗ
			|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
	    ДатаСтрокой = Формат(Дата, "ДФ=dd.MM.yyyy"); 
	    ТекстСообщения = СтрШаблон("На %1 г. cотруднику - %2 - не установлен процент от выполненных работ!", ДатаСтрокой, Специалист);
	    ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	    Отказ = Истина;
	    Возврат;
	КонецЕсли;
	
	ПроцентОтРабот = Выборка.ПроцентОтРабот;
		
    Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
    Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
    
    Для Каждого ТекСтрока из ВыполненныеРаботы Цикл
        Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
        Движение.Период = Дата;
        Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
        Движение.Клиент = Клиент;
        Движение.Договор = Договор;
        Движение.КоличествоЧасов = ТекСтрока.ЧасыКОплатеКлиенту;
        Движение.СуммаКОплате = ТекСтрока.ЧасыКОплатеКлиенту * СтоимостьЧасаКлиента;
    
    	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ТекСтрока.ЧасыКОплатеКлиенту;
		
		Если ПроцентОтРабот > 0 Тогда
	    	Движение.СуммаКОплате = ТекСтрока.ЧасыКОплатеКлиенту * СтоимостьЧасаКлиента * ПроцентОтРабот / 100;
		Иначе
	    	Движение.СуммаКОплате = 0;
		КонецЕсли;

   КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьФамилиюСпециалиста(Знач СсылкаСпециалист)
	
	Если НЕ ЗначениеЗаполнено(СсылкаСпециалист) Тогда
		Возврат "Специалист";
	КонецЕсли;

	ПолноеИмя = Строка(СсылкаСпециалист);
	ПозицияПробела = СтрНайти(ПолноеИмя, " ");

	Если ПозицияПробела > 0 Тогда
		Результат = Лев(ПолноеИмя, ПозицияПробела - 1);
	Иначе
		Результат = ПолноеИмя;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции


Процедура СоздатьСообщениеБоту(ТекстСообщения)		// Вспомогательная процедура для записи в справочник
	
	НоваяЗапись = Справочники.ВКМ_УведомленияТБоту.СоздатьЭлемент();
	НоваяЗапись.ТекстСообщения = ТекстСообщения;
	НоваяЗапись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
