#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// +++
	// ВКМ Супонев - Дипломный проект
	//
	// Заполнение списка выбора времени - Кратность 1 час
		
	ЗаполнитьВыпадающийСписокНачала();
	
	Если ЗначениеЗаполнено(Объект.ВремяНачалаРабот) Тогда
		ЗаполнитьВыпадающийСписокОкончания();
	КонецЕсли;
	
	// Отображение только Специалистов на форме

	СписокСпецов = ПолучитьСписокСпециалистовНаСервере();

	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", СписокСпецов);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(НовыйПараметр);

	Элементы.Специалист.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
	// ВКМ Супонев - Дипломный проект
	// +++
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// +++
	// ВКМ Супонев - Дипломный проект
	// Обращение к видимости реквизитовв при Абонентском Обслуживании
	
	ВКМ_ОбновитьПоказателиДоговораНаСервере();
	
	// ВКМ Супонев - Дипломный проект
	// +++
КонецПроцедуры



&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

	// +++
	// ВКМ Супонев - Дипломный проект
	// Проверка даты проведения работ

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьДатуПроведенияРабот(Отказ);
КонецПроцедуры

	// ВКМ Супонев - Дипломный проект
	// +++
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
	
	// +++
	// ВКМ Супонев - Дипломный проект
	// Обращение к видимости реквизитовв при Абонентском Обслуживании
	
&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ВКМ_ОбновитьПоказателиДоговораНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Объект.Договор = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	УстановитьОтборДоговоров();
	ВКМ_ОбновитьПоказателиДоговораНаСервере();
	
КонецПроцедуры

	// Проверки даты и времени проведения работ
	
&НаКлиенте
Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	ПроверитьДатуПроведенияРабот();
КонецПроцедуры
	
&НаКлиенте
Процедура ВремяНачалаРаботПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВремяНачалаРабот) Тогда
		Если Не ЗначениеЗаполнено(Объект.ВремяОкончанияРабот) Тогда
			Объект.ВремяОкончанияРабот = Объект.ВремяНачалаРабот + 3600;
		ИначеЕсли Объект.ВремяОкончанияРабот <= Объект.ВремяНачалаРабот Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Внимание! Время окончания работ не может быть меньше или равно времени начала!");
			Объект.ВремяОкончанияРабот = Объект.ВремяНачалаРабот + 3600;
		КонецЕсли;
		ЗаполнитьВыпадающийСписокОкончанияНаСервере();
	Иначе
		Объект.ВремяОкончанияРабот = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

	// +++
	// ВКМ Супонев - Дипломный проект

	// показываю Только договоры абон.обсл.
	
&НаКлиенте
Процедура УстановитьОтборДоговоров()
	
	НовыйОтбор = Новый Массив;
	НовыйОтбор.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Объект.Клиент));
	НовыйОтбор.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание")));
	
	Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйОтбор);
	
КонецПроцедуры

	// показываю Подсказку по Договору абон.обсл.
	
&НаСервере
Процедура ВКМ_ОбновитьПоказателиДоговораНаСервере()
	
	Если Объект.Договор.Пустая() Тогда
		Элементы.ГруппаИнфоАбонПлаты.Видимость = Ложь;
		ВКМ_АбонПлатаПредставление = 0;
		ВКМ_СтоимостьЧасаПредставление = 0;
		Возврат;
	КонецЕсли;
		
	Список = "ВидДоговора, ВКМ_СуммаАбонентскойПлаты, ВКМ_СтоимостьЧасаРаботы, ВКМ_ОкончаниеДействияДоговора";
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, Список);
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(РеквизитыДоговора.ВКМ_ОкончаниеДействияДоговора) 
		И РеквизитыДоговора.ВКМ_ОкончаниеДействияДоговора < НачалоДня(ТекущаяДатаСеанса) Тогда
		Элементы.ГруппаИнфоАбонПлаты.ЦветФона = WebЦвета.СветлоРозовый;
	Иначе
		Элементы.ГруппаИнфоАбонПлаты.ЦветФона = WebЦвета.СветлоЗеленый;  
	КонецЕсли;

	Если РеквизитыДоговора.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ГруппаИнфоАбонПлаты.Видимость = Истина;
		ВКМ_АбонПлатаПредставление = РеквизитыДоговора.ВКМ_СуммаАбонентскойПлаты;
		ВКМ_СтоимостьЧасаПредставление = РеквизитыДоговора.ВКМ_СтоимостьЧасаРаботы;
	Иначе
		Элементы.ГруппаИнфоАбонПлаты.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

	// Заполнение даты, время начала - окончанияя работ
	
&НаКлиенте
Процедура ПроверитьДатуПроведенияРабот(Отказ = Ложь)
	
	ТекущаяДатаНаСервере = ОбщегоНазначенияКлиент.ДатаСеанса(); 
	ЗавтрашнийДень = НачалоДня(ТекущаяДатаНаСервере + 86400);
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПроведенияРабот) Тогда
		Объект.ДатаПроведенияРабот = ЗавтрашнийДень;
		Возврат;
	КонецЕсли;
	
	Если НачалоДня(Объект.ДатаПроведенияРабот) < ЗавтрашнийДень Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Дата проведения работ изменена на ближайшую возможную (завтра).");
		Объект.ДатаПроведенияРабот = ЗавтрашнийДень;
	КонецЕсли;

КонецПроцедуры

&НаСервере         // заполняю Время на Сервере, т.к. создание Нового док-та тоже на сервере
Процедура ЗаполнитьВыпадающийСписокНачала()
	
	БазоваяДата = '00010101'; 
	ЭлементНачало = Элементы.ВремяНачалаРабот;
	ЭлементНачало.СписокВыбора.Очистить();
	
	// Начало -  с 8 до 20
	Для Час = 8 По 20 Цикл
		ЗначениеВремени = БазоваяДата + (Час * 3600); 
		ЭлементНачало.СписокВыбора.Добавить(ЗначениеВремени, Формат(ЗначениеВремени, "ДФ=ЧЧ:мм"));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыпадающийСписокОкончания()
	
	БазоваяДата = '00010101'; 
	ЭлементКонец = Элементы.ВремяОкончанияРабот;
	ЭлементКонец.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ВремяНачалаРабот) Тогда
		ЧасНачала = Час(Объект.ВремяНачалаРабот) + 1;
	Иначе
		ЧасНачала = 9; 
	КонецЕсли;
	
	Для Час = ЧасНачала По 21 Цикл
		ЗначениеВремени = БазоваяДата + (Час * 3600); 
		ЭлементКонец.СписокВыбора.Добавить(ЗначениеВремени, Формат(ЗначениеВремени, "ДФ=ЧЧ:мм"));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыпадающийСписокОкончанияНаСервере()
	ЗаполнитьВыпадающийСписокОкончания();
КонецПроцедуры

	// Отображение только Специалистов на форме
	
&НаСервереБезКонтекста
Функция ПолучитьСписокСпециалистовНаСервере()
	
	МассивСпецов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВКМ_УсловияОплатыСотрудников.Сотрудник КАК Сотрудник
			|ИЗ
			|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудников
			|ГДЕ
			|	ВКМ_УсловияОплатыСотрудников.Категория = ЗНАЧЕНИЕ(Перечисление.ВКМ_КатегорииСотрудников.Специалисты)";
		
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивСпецов.Добавить(Выборка.Сотрудник);
	КонецЦикла;

	Возврат Новый ФиксированныйМассив(МассивСпецов);
	
КонецФункции

	// ВКМ Супонев - Дипломный проект
	// +++
	
#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

#КонецОбласти
