#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОтпускаСотрудниковКатегория.ТолькоПросмотр = Истина;
	
	ОбновитьПодсветкуСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьПодсветкуСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПодсветкуСтрок();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если СтрокаТаблицы <> Неопределено Тогда
       СтрокаТаблицы.Категория = ПолучитьКатегориюИзРегистра(СтрокаТаблицы.Сотрудник, Объект.Дата);
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент) //Реакция в моменте на ошибки при редактировании уже созданного док.
	
	ОбновитьПодсветкуСтрок();
	
	СтрокаТаблицы = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если СтрокаТаблицы <> Неопределено Тогда
		
		Если СтрокаТаблицы.ДатаОкончания <= СтрокаТаблицы.ДатаНачала Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Укажите корректную Дату окончания отпуска!";
			Сообщение.Поле = СтрШаблон("ОтпускаСотрудников[%1].ДатаОкончания", Элементы.ОтпускаСотрудников.ТекущаяСтрока);
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ОбновитьПодсветкуСтрок();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроанализироватьГрафик(Команда)
   
    АдресВоВременномХранилище = ПоместитьДанныеВоХранилищеНаСервере();
    ПараметрыДляФормы = Новый Структура("АдресДанных", АдресВоВременномХранилище);

    ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыДляФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПодсветкуСтрок()
	
    Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл
    	
        КоличествоДней = (СтрокаОтпуска.ДатаОкончания - СтрокаОтпуска.ДатаНачала) / 86400 + 1;
        СтрокаОтпуска.ДлительныйОтпуск = (КоличествоДней > 28);

    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВоХранилищеНаСервере()
	
    СтруктураДанных = Новый Структура;
    СтруктураДанных.Вставить("Год", Объект.Год);
    СтруктураДанных.Вставить("Отпуск", Объект.ОтпускаСотрудников.Выгрузить());
    
    Возврат ПоместитьВоВременноеХранилище(СтруктураДанных, УникальныйИдентификатор); 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКатегориюИзРегистра(ВыбранныйСотрудник, ДатаДокумента)
	
	МенеджерРегистра = РегистрыСведений.ВКМ_УсловияОплатыСотрудников;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Сотрудник", ВыбранныйСотрудник);
	
	АктуальныеДанные = МенеджерРегистра.СрезПоследних(ДатаДокумента, Отбор);
	
	Если АктуальныеДанные.Количество() > 0 Тогда
		Возврат АктуальныеДанные[0].Категория;
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.ВКМ_КатегорииСотрудников.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

#КонецОбласти