#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СоздатьДокументы(Параметры) Экспорт 

	Если ТипЗнч(Параметры) = Тип("Массив") Тогда		// БСП всегда передает параметры в массиве
		ПараметрыЗапуска = Параметры[0];
	Иначе
		ПараметрыЗапуска = Параметры;
	КонецЕсли;

	Если ТипЗнч(ПараметрыЗапуска) = Тип("Структура") Тогда			//«защита от дурака» передачи Даты
		Период = ПараметрыЗапуска.Период;
	Иначе
		Период = ПараметрыЗапуска;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Период) Тогда
		Возврат Новый Массив; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Договора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договора.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	ВТ_Договора КАК ВТ_Договора
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Договора.Ссылка = РеализацияТоваровУслуг.Договор
	|			И (РеализацияТоваровУслуг.Проведен = ИСТИНА)
	|			И (НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВТ_Договора.Ссылка = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Договора.Ссылка,
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Организация";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Период", Период);

    Выборка = Запрос.Выполнить().Выбрать();
    МассивДляХранилища = Новый Массив;

    НачалоВыбранногоМесяца = НачалоМесяца(Период);
    КонецВыбранногоМесяца  = КонецМесяца(Период);
    
    Пока Выборка.Следующий() Цикл
     
        ДатаНачала = Выборка.Договор.ВКМ_НачалоДействияДоговора;
        ДатаКонца  = Выборка.Договор.ВКМ_ОкончаниеДействияДоговора;
    
        Если ЗначениеЗаполнено(ДатаНачала) И (ДатаНачала > КонецВыбранногоМесяца) Тогда		//отсеиваю ненужные
            Продолжить;
        КонецЕсли;
  
        Если ЗначениеЗаполнено(ДатаКонца) И (ДатаКонца < НачалоВыбранногоМесяца) Тогда
            Продолжить;
        КонецЕсли;
        
        ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
        ДокументРеализация.Заполнить(Выборка.Договор); 
        
        ДокументРеализация.Дата = КонецВыбранногоМесяца;
        ДокументРеализация.Договор = Выборка.Договор;
        ДокументРеализация.Контрагент = Выборка.Контрагент; 
        ДокументРеализация.Организация = Выборка.Организация;
        
        ДокументРеализация.АвтозаполнениеДокумента();
        
        ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
        
        СтруктураСтроки = Новый Структура("Договор, РеализацияТоваровУслуг", Выборка.Договор, ДокументРеализация.Ссылка);
        МассивДляХранилища.Добавить(СтруктураСтроки);
        
    КонецЦикла;
    
    Возврат МассивДляХранилища;
    
КонецФункции

#КонецОбласти

#КонецЕсли

