#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;	
	
	Для Каждого ТекущаяСтрока из СписокСотрудников Цикл
		
		ДвижениеНачислениеФиксПремии = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеНачислениеФиксПремии.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;		
		ДвижениеНачислениеФиксПремии.ПериодРегистрации = Дата;
		ДвижениеНачислениеФиксПремии.Сотрудник = ТекущаяСтрока.Сотрудник;
		ДвижениеНачислениеФиксПремии.Результат = ТекущаяСтрока.СуммаПремии;
		
		ДвижениеУдержания = Движения.ВКМ_Удержания.Добавить();
		ДвижениеУдержания.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеУдержания.ПериодРегистрации = Дата;
		ДвижениеУдержания.Сотрудник = ТекущаяСтрока.Сотрудник;
		УдержаниеНДФЛ =  ТекущаяСтрока.СуммаПремии * 13 / 100;
		ДвижениеУдержания.Результат = УдержаниеНДФЛ;

		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.Сумма = ТекущаяСтрока.СуммаПремии - УдержаниеНДФЛ;
		ДвижениеВзаиморасчеты.Период = Дата;
		ДвижениеВзаиморасчеты.Сотрудник = ТекущаяСтрока.Сотрудник;
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли