#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
		Для Каждого Стр Из ОтпускаСотрудников Цикл
		
			Если Стр.ДатаОкончания <= Стр.ДатаНачала Тогда
				НомерСтроки = ОтпускаСотрудников.Индекс(Стр) + 1;
				ТекстОшибки = СтрШаблон("В строке № %1: У сотрудника %2 некорректно указаны даты планируемого отпуска!", НомерСтроки, Стр.Сотрудник);
				ПутьКПолю = "ОтпускаСотрудников[" + ОтпускаСотрудников.Индекс(Стр) + "].ДатаОкончания";
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКПолю, , Отказ);
			КонецЕсли;
		
		КонецЦикла;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Движения.ВКМ_ПланированиеОтпусковСотрудников.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) +1 КАК Продолжительность
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ПланированиеОтпусковСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Запланировано = ВыборкаДетальныеЗаписи.Продолжительность;
		Движение.Период = НачалоГода(Год);
				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли