#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();
	 
	РассчитатьОклад(); 
	РасчитатьОтпускные();		
	РассчитатьПремиюЗаВыполненныеРаботы();
	
	СформироватьВзаиморасчеты();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения() 
	
	СформироватьДвиженияПоОкладу(); 
	СформироватьДвиженияПрочиеОсновныеНачисления();	//Отпуск

	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияПоОкладу() 
		
	Отбор = Новый Структура;
	Отбор.Вставить("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	СтрокиОклада = Начисления.НайтиСтроки(Отбор);
	
	Если СтрокиОклада.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МинДатаНачала = СтрокиОклада[0].ДатаНачала;
	МаксДатаОкончания = СтрокиОклада[0].ДатаОкончания;
	
	Для Сч = 1 по СтрокиОклада.Количество()-1 Цикл
		
		Если МинДатаНачала > СтрокиОклада[Сч].ДатаНачала Тогда
			МинДатаНачала = СтрокиОклада[Сч].ДатаНачала;
		КонецЕсли;
		
		Если МаксДатаОкончания < СтрокиОклада[Сч].ДатаОкончания Тогда
			МаксДатаОкончания = СтрокиОклада[Сч].ДатаОкончания;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_НачислениеЗарплатыНачисления.Сотрудник,
	|	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала,
	|	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания,
	|	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета,
	|	ВКМ_НачислениеЗарплатыНачисления.ГрафикРаботы
	|ПОМЕСТИТЬ ВТ_ПериодыОкладаИсходные
	|ИЗ
	|	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	|	И ВКМ_НачислениеЗарплатыНачисления.ВидРасчета = &Оклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад
	|ПОМЕСТИТЬ ВТ_ИзмененияОклада
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&МинимальнаяДатаНачала, Сотрудник В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ВТ_ПериодыОкладаИсходные.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТ_ПериодыОкладаИсходные КАК ВТ_ПериодыОкладаИсходные)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудников.Период,
	|	ВКМ_УсловияОплатыСотрудников.Сотрудник,
	|	ВКМ_УсловияОплатыСотрудников.Оклад
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
	|ГДЕ
	|	ВКМ_УсловияОплатыСотрудников.Период > &МинимальнаяДатаНачала
	|	И ВКМ_УсловияОплатыСотрудников.Период <= &МаксимальнаяДатаОкончания
	|	И ВКМ_УсловияОплатыСотрудников.Сотрудник В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ВТ_ПериодыОкладаИсходные.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТ_ПериодыОкладаИсходные КАК ВТ_ПериодыОкладаИсходные)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатаНачала.Сотрудник,
	|	ДатаНачала.Оклад КАК Оклад,
	|	ДатаНачала.Период КАК ДатаНачала,
	|	МИНИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ДатаОкончания.Период, СЕКУНДА, -1), ДАТАВРЕМЯ(3999, 12, 31))) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ИнтервалыОклада
	|ИЗ
	|	ВТ_ИзмененияОклада КАК ДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзмененияОклада КАК ДатаОкончания
	|		ПО ДатаНачала.Сотрудник = ДатаОкончания.Сотрудник
	|		И ДатаНачала.Период < ДатаОкончания.Период
	|СГРУППИРОВАТЬ ПО
	|	ДатаНачала.Сотрудник,
	|	ДатаНачала.Период,
	|	ДатаНачала.Оклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыОкладаИсходные.Сотрудник,
	|	ВТ_ПериодыОкладаИсходные.ВидРасчета,
	|	ВТ_ПериодыОкладаИсходные.ГрафикРаботы,
	|	ВТ_ИнтервалыОклада.Оклад КАК Показатель,
	|	ВЫБОР
	|		КОГДА ВТ_ИнтервалыОклада.ДатаНачала > ВТ_ПериодыОкладаИсходные.ДатаНачала
	|			ТОГДА ВТ_ИнтервалыОклада.ДатаНачала
	|		ИНАЧЕ ВТ_ПериодыОкладаИсходные.ДатаНачала
	|	КОНЕЦ КАК ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА ВТ_ИнтервалыОклада.ДатаОкончания < ВТ_ПериодыОкладаИсходные.ДатаОкончания
	|			ТОГДА ВТ_ИнтервалыОклада.ДатаОкончания
	|		ИНАЧЕ ВТ_ПериодыОкладаИсходные.ДатаОкончания
	|	КОНЕЦ КАК ПериодДействияКонец
	|ИЗ
	|	ВТ_ПериодыОкладаИсходные КАК ВТ_ПериодыОкладаИсходные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИнтервалыОклада КАК ВТ_ИнтервалыОклада
	|		ПО ВТ_ПериодыОкладаИсходные.Сотрудник = ВТ_ИнтервалыОклада.Сотрудник
	|		И ВТ_ИнтервалыОклада.ДатаНачала <= ВТ_ПериодыОкладаИсходные.ДатаОкончания
	|		И ВТ_ПериодыОкладаИсходные.ДатаНачала <= ВТ_ИнтервалыОклада.ДатаОкончания";
	
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("МинимальнаяДатаНачала", МинДатаНачала);
	Запрос.УстановитьПараметр("МаксимальнаяДатаОкончания", МаксДатаОкончания);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи); 
		Движение.ПериодРегистрации = Дата;
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияПрочиеОсновныеНачисления() //Отпуск
	
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		
		Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрокаНачисления.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Продолжить;
		КонецЕсли;
				
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаОкончания;
		Движение.ПериодРегистрации = Дата; 
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.ГрафикРаботы = ТекСтрокаНачисления.ГрафикРаботы;
		
		Если ТекСтрокаНачисления.ВидРасчета =  ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(ТекСтрокаНачисления.ДатаНачала, -12));	  // База за 12 месяцев
			Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(ТекСтрокаНачисления.ДатаНачала, -1));
			Движение.ОтработаноДней = (КонецДня(ТекСтрокаНачисления.ДатаОкончания) - НачалоДня(ТекСтрокаНачисления.ДатаНачала) + 1) / 86400;	// ФИКСИРУЮ КАЛЕНДАРНЫЕ ДНИ
		КонецЕсли;
		 
	КонецЦикла;

КонецПроцедуры

Процедура РассчитатьОклад() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия КАК Факт,
	|	ОсновныеНачисленияДанныеГрафика.РабочийДеньПериодДействия КАК Норма,
	|	ОсновныеНачисленияДанныеГрафика.Сотрудник
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(ВидРасчета = &Оклад
	|	И Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1]; 
		ОплатаПоОкладу = Движение.Показатель * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.Норма;
		Движение.Результат = ОплатаПоОкладу;
		Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.Факт;	
			
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Результат = ОплатаПоОкладу * 13 / 100;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура РасчитатьОтпускные() 	//И деньги и дни
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(БазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК БазаДоп,
		|	ЕСТЬNULL(БазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК БазаОсн,	
		|	ЕСТЬNULL(БазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК БазаОтработано,
		|	ЕСТЬNULL(ДанныеГрафика.РабочийДеньФактическийПериодДействия, 0) КАК Факт,
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,	
		|	ВКМ_ОсновныеНачисления.ПериодДействияНачало КАК ДатаНачала
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления	
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,,
		|			Регистратор = &Ссылка
		|		И ВидРасчета = &Отпуск) КАК БазаВКМ_ОсновныеНачисления	
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = БазаВКМ_ОсновныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения,,
		|			Регистратор = &Ссылка	
		|		И ВидРасчета = &Отпуск) КАК БазаВКМ_ДополнительныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = БазаВКМ_ДополнительныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка	
		|		И ВидРасчета = &Отпуск) КАК ДанныеГрафика
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ДанныеГрафика.НомерСтроки
		|ГДЕ	
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.ВКМ_ПланированиеОтпусковСотрудников.Записывать = Истина;
	Движения.ВКМ_ПланированиеОтпусковСотрудников.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

	    Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1]; 		
	    
	    Если ВыборкаДетальныеЗаписи.БазаОтработано = 0 Тогда
	        Движение.Результат = 0;		
	        Продолжить;
	    КонецЕсли;
    
   		// ТЗ из Диплома: (Сумма / Рабочие дни базы) * Календарные дни отпуска    	
	    ОплатаОтпуска = (ВыборкаДетальныеЗаписи.БазаОсн + ВыборкаДетальныеЗаписи.БазаДоп) / ВыборкаДетальныеЗаписи.БазаОтработано * ВыборкаДетальныеЗаписи.Факт;
	    Движение.Результат = ОплатаОтпуска;
																
		ДвижениеУдержание = Движения.ВКМ_Удержания.Добавить();
		ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеУдержание.ПериодРегистрации = Дата;
		ДвижениеУдержание.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		ДвижениеУдержание.Результат = ОплатаОтпуска * 13 / 100;
				
		ДвижениеОтпуск = Движения.ВКМ_ПланированиеОтпусковСотрудников.Добавить();		// Запись израсходованных дней отпуска в регистр накопления
		ДвижениеОтпуск.Период = ВыборкаДетальныеЗаписи.ДатаНачала;
		ДвижениеОтпуск.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		ДвижениеОтпуск.Использовано = ВыборкаДетальныеЗаписи.Факт; 
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ПланированиеОтпусковСотрудников.Записать();

КонецПроцедуры


Процедура РассчитатьПремиюЗаВыполненныеРаботы()
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_СотрудникиИзДокумента
		|ИЗ
		|	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СотрудникиИзДокумента.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаОборота,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК Процент
		|ИЗ
		|	ВТ_СотрудникиИзДокумента КАК ВТ_СотрудникиИзДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВТ_СотрудникиИзДокумента.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
		|		ПО ВТ_СотрудникиИзДокумента.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Категория = ЗНАЧЕНИЕ(Перечисление.ВКМ_КатегорииСотрудников.Специалисты)";

			
	Если Начисления.Количество() > 0 Тогда			// Использую начало и конец ПРЕДЫДУЩЕГО месяца - выплачиваем проценты за прошлый месяц
	    ДатаДляРасчета = Начисления[0].ДатаНачала;	// Беру дату из первой строки табличной части, чтобы понять, за какой месяц считаем Премии
	Иначе
	    ДатаДляРасчета = Дата;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаДляРасчета));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДатаДляРасчета));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СуммаПремии = ВыборкаДетальныеЗаписи.СуммаОборота * (ВыборкаДетальныеЗаписи.Процент / 100); // Сумма премии: Оборот * (Процент / 100)
	
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить(); 
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияЗаВыполненныеРаботы;		
		Движение.ПериодРегистрации = НачалоМесяца(ДатаДляРасчета); // Использую начало месяца расчета
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Результат = СуммаПремии;
		//Движение.Регистратор = Ссылка;
			
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = НачалоМесяца(ДатаДляРасчета);
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Результат = СуммаПремии * 13 / 100;

	КонецЦикла;

КонецПроцедуры

Процедура СформироватьВзаиморасчеты() 
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИтоговыеДанные.Сотрудник КАК Сотрудник,
		|	СУММА(ИтоговыеДанные.Сумма) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		ВКМ_ОсновныеНачисления.Результат КАК Сумма
		|	ИЗ
		|		РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|	ГДЕ
		|		ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВКМ_ДополнительныеНачисления.Сотрудник,
		|		ВКМ_ДополнительныеНачисления.Результат
		|	ИЗ
		|		РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|	ГДЕ
		|		ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВКМ_Удержания.Сотрудник,
		|		-ВКМ_Удержания.Результат
		|	ИЗ
		|		РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|	ГДЕ
		|		ВКМ_Удержания.Регистратор = &Ссылка) КАК ИтоговыеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтоговыеДанные.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.Сумма;
		Движение.Период = Дата;
			
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли