#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Автозаполнение(Команда)
	
	Если Объект.Проведен Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо отменить проведение Документа!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВыплатыСотрудникам();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьВыплатыСотрудникам()

	Объект.Выплаты.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Остатки.Сотрудник,
		|	Остатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, ) КАК Остатки
		|ГДЕ
		|	Остатки.СуммаОстаток > 0";

	Запрос.УстановитьПараметр("Период", Новый Граница(Объект.Дата, ВидГраницы.Включая));

	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	КолСтрок = ТаблицаРезультата.Количество();
	
	Если КолСтрок > 0 Тогда
		Объект.Выплаты.Загрузить(ТаблицаРезультата);
		ТекстСообщения = СтрШаблон("Заполнение Документа завершено. Создано %1 строк в документе", КолСтрок);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Задолженностей перед Сотрудниками не обнаружено");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти