#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ОтправкаУведомленияТГБот() Экспорт
	
	Токен = Константы.ВКМ_ТокенУправленияТБотом.Получить();
	ЧатИД = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Если ПустаяСтрока(Токен) Или ПустаяСтрока(Строка(ЧатИД)) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ

	|	ВКМ_УведомленияТБоту.ТекстСообщения КАК ТекстСообщения,
	|	ВКМ_УведомленияТБоту.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВКМ_УведомленияТБоту КАК ВКМ_УведомленияТБоту";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Используем принудительное отключение прокси, как мы выяснили ранее
	ПроксиДляСоединения = Новый ИнтернетПрокси(Ложь); 
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , ПроксиДляСоединения, 10, Новый ЗащищенноеСоединениеOpenSSL());
	
	Пока Выборка.Следующий() Цикл
		
		Данные = Новый Структура;
		Данные.Вставить("chat_id", СтрЗаменить(Формат(ЧатИД, "ЧГ=0"), Символы.НПП, ""));
		Данные.Вставить("text",    Выборка.ТекстСообщения);
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Ресурс = "bot" + Токен + "/sendMessage";
		ЗапросHTTP = Новый HTTPЗапрос(Ресурс);
		ЗапросHTTP.Заголовки.Вставить("Content-Type", "application/json");
		ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
		
		Попытка			
			
			Ответ = Соединение.ОтправитьДляОбработки(ЗапросHTTP); 
			//Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP); 
			
			Если Ответ.КодСостояния = 200 Тогда
				Объект = Выборка.Ссылка.ПолучитьОбъект();
				Если Объект <> Неопределено Тогда
					Объект.Удалить(); 
				КонецЕсли;
			Иначе
				ЗаписьЖурналаРегистрации("Телеграм.Ошибка", УровеньЖурналаРегистрации.Ошибка, , , Ответ.ПолучитьТелоКакСтроку());
			КонецЕсли;
						
		Исключение
			
			ЗаписьЖурналаРегистрации("Телеграм.Исключение", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
