#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, ГрафикРаботы) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить(ГрафикРаботы);
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	Дат = НачалоДня(ДатаНачала);
	КонечнаяДата = НачалоДня(ДатаОкончания);
	
	ИндексОбхода = 0;
	Пока Дат <= КонечнаяДата Цикл
		
		ЗаписьНайдена = Ложь;

		Пока ИндексОбхода < Набор.Количество() Цикл
			Запись = Набор[ИндексОбхода];
			
			Если НачалоДня(Запись.Дата) < Дат Тогда
				ИндексОбхода = ИндексОбхода + 1;
				Продолжить;
			ИначеЕсли НачалоДня(Запись.Дата) = Дат Тогда
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.РабочийДень = 0;
				Иначе	          
					Запись.РабочийДень = 1; 
				КонецЕсли;
				ЗаписьНайдена = Истина;
				ИндексОбхода = ИндексОбхода + 1;
				Прервать;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если Не ЗаписьНайдена Тогда
			
			НоваяЗапись = Набор.Добавить();
			НоваяЗапись.ГрафикРаботы = ГрафикРаботы;
			НоваяЗапись.Дата = Дат;
			Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				НоваяЗапись.РабочийДень = 0;
			Иначе	          
				НоваяЗапись.РабочийДень = 1;
			КонецЕсли;
			
		КонецЕсли;
		
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

